Autodesk.Revit.DB.FabricationPartType.GetAllLoadedFabricationPartTypes(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPartType.FindAllFabricationPartTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPartType.Lookup(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32)
Looks up an existing fabrication part type based on a specfic fabrication service button and condition.
document:
The document.
button:
The fabrication service button.
condition:
The condition index.
Returns:
Identifier of the fabrication part type element or invalidElementId if no fabrication part type exist for the
specific fabrication service button and condition
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2016

Autodesk.Revit.DB.FabricationPartType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32)
Creates a fabrication part type element based on a specific fabrication servic button and condition.
document:
The document.
button:
The fabrication service button.
condition:
The condition index.
Returns:
The created fabrication part type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type already exists.
Since:
2016

Autodesk.Revit.DB.FabricationPartType.IsLoadedOutOfService
Flag to check if the fabrication part type has been loaded so that it is available out of service.
Since:
2019

Autodesk.Revit.DB.FabricationPartType.ItemPath
The path of the item file.
Since:
2019

Autodesk.Revit.DB.FabricationPartType
Represents a fabrication component type in the Autodesk Revit MEP product.
Remarks:
For the product-based MAP parts, every size is a new part type in Revit. For others, one part type can have many sizes.
Since:
2016